app/views/comments/_comment.html.erb

    <div class="avatar_container">
      <%= image_tag "#{comment.user.avatar.default_url}", size: "40x40", class: "profile_image avatar" if !comment.user.sns_avatar? && comment.user.avatar.blank? %>
---
SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1