app/views/searches/new.html.erb

        <%= f.input :keywords, required: true, autofocus: true, placeholder: t("searches.placeholder.keywords"), label: t("searches.label.keywords"), input_html: { class: "input_shadow radius kewords" } %>
        <%= f.input :category_id, :collection => Category.all, :label_method => :name, :value_method => :id, required: false, autofocus: false, label: t("searches.label.category"), prompt: t("searches.placeholder.category"), input_html: { class: "input_shadow radius category" } %>
---
SELECT "categories".* FROM "categories"