app/views/posts/_borderless.html.erb

SELECT COUNT(*) FROM "posts"
---
  <section class="header clearfix">
    <div class="title_container"><%= t("posts.total_html", total: "#{@posts.size}") %></div>

SELECT  "users".* FROM "users"  WHERE "users"."id" = 2  ORDER BY "users"."id" ASC LIMIT 1
---
              <li class="user">
                <%= image_tag "#{post.user.avatar.default_url}", size: "27x27", class: "profile_image avatar" if !post.user.sns_avatar? && post.user.avatar.blank? %>