app/views/posts/_form.html.erb

SELECT "categories".* FROM "categories"
---
<%= simple_form_for(@post, html: { class: "post_form" }) do |f| %>
    <%= f.association :category, input_html: { class: "category input_shadow radius" }, label: false, required: false, wrapper: false, placeholder: t("categories.placeholder.select_category") %>