app/controllers/categories_controller.rb

  def index
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_params)
    @category.user_id = current_user

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2015-03-24 02:58:16.462929"], ["name", "요리"], ["updated_at", "2015-03-24 02:58:16.462929"]]

  def set_category
    @category = Category.find(params[:id])
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = ? LIMIT 1  [["id", 1]]