app/controllers/comments_controller.rb

INSERT INTO "comments" ("body", "commentable_id", "commentable_type", "created_at", "lft", "rgt", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create

    if params[:comment][:body].present?
      @comment.user_id = current_user.id
      @comment.created_at = Time.now