app/controllers/posts_controller.rb

  def show
    @obj = @post
    @comment = Comment.build_from(@post, current_user.id, "") if signed_in?
    @comments = @post.comment_threads

    # Count Views
    if signed_in?
      @post.views.create(user_id: current_user.id, created_at: Time.now, updated_at: Time.now, ip: current_user.current_sign_in_ip) if (@post.views.where(user_id: current_user.id).blank?) && (@post.views.where(ip: current_user.current_sign_in_ip).blank?)
---
INSERT INTO "views" ("created_at", "ip", "updated_at", "user_id", "viewable_id", "viewable_type") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-03-24 03:02:23.947169"], ["ip", "127.0.0.1"], ["updated_at", "2015-03-24 03:02:23.947173"], ["user_id", 2], ["viewable_id", 1], ["viewable_type", "Post"]]

  def create
    @post = Post.new(post_params)
    @post.user = current_user

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "category_id", "created_at", "slug", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def set_post
    # @post = Post.find(params[:id])
    @post = Post.find_by_slug(params[:id])
---
SELECT  "posts".* FROM "posts"  WHERE "posts"."slug" = 'programming-with-yii2-integrating-user-registration' LIMIT 1