app/controllers/searches_controller.rb

INSERT INTO "searches" ("created_at", "keywords", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-03-24 03:03:21.182594"], ["keywords", "programming"], ["updated_at", "2015-03-24 03:03:21.182594"], ["user_id", 2]]
---
  def create
    @search = Search.new(keywords: params[:search][:keywords], category_id: params[:search][:category_id])
    @search.user_id = current_user.id if signed_in?
    @search.user_id = nil unless signed_in?
    @search.save

SELECT  "searches".* FROM "searches"  WHERE "searches"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @search = Search.find(params[:id])