app/views/categories/index.html.erb

    <section class="header clearfix">
      <div class="title_container"><%= t("categories.total_html", total: "#{@categories.size}") %></div>
---
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "categories"