app/views/categories/show.html.erb

    <section class="header clearfix">
      <div class="title_container"><%= t("categories.related_post_html", name: "#{@category.name}",total: "#{@category.posts.size}") %></div>
---
SELECT COUNT(*) FROM "posts"  WHERE "posts"."category_id" = ?  [["category_id", 1]]