app/views/layouts/_default_blog.html.erb

  <div class="large-10 columns">
    <% if Post.any? %>
---
SELECT COUNT(*) FROM "posts"

          <% @category.each do |category| %>
              <li><%= link_to "• #{category.name} <small>(#{category.posts.size})</small>".html_safe, category, class: "ease" %></li>
---
SELECT COUNT(*) FROM "posts"  WHERE "posts"."category_id" = ?  [["category_id", 1]]